{
  "deposit": "512000000uatone",
  "messages": [
    {
      "@type": "/atomone.gov.v1.MsgProposeConstitutionAmendment",
      "amendment": "--- src\n+++ dst\n@@ -38,18 +38,18 @@ universe of the Cosmos.\n ### Section 1: Fundamental Principles\n \n This Constitution of the AtomOne Hub, hereinafter **“Constitution”**, hereby\n-establishes the foundations of the governance model, economical model, and\n+establishes the foundations of the governance model, economic model, and\n operating system of the AtomOne Hub.\n \n All subsequent governance proposals shall align with the provisions of this\n Constitution, and proponents of each proposal, along with all active governance\n voters, are required to ensure consistency between such proposals and this\n-Constitution, and cannot violate any explicit restriction. \n+Constitution, and cannot violate any explicit restriction.\n \n Amendments are permitted to innovate and adapt this Constitution, but they must\n still respect and adhere to the fundamental principles upon which this\n Constitution is founded, and are subject to specific procedures as described in\n-Article 4, Section 4.\n+Article 2, Section 2 as well as any applicable law.\n \n ### Section 2: Sovereignty of the AtomOne Hub\n \n@@ -59,7 +59,7 @@ Interchain network.\n The AtomOne Hub is composed of many chains: the root hub chain, where staking\n and governance transactions are committed and executed, but also other chains\n (core shards) secured by Interchain Security (ICS) that are subservient to the\n-governance of the root hub chain, hereinafter referred to as \"Hub Governance\".\n+governance of the root hub chain, hereinafter referred to as “Hub Governance”.\n \n Other sovereign zones (consumer shards) that are completely or partially\n secured by AtomOne Hub ICS, by definition, have their own governance mechanism.\n@@ -79,7 +79,7 @@ Tolerant (BFT) proof-of-stake multi-token payment and transfer system; and to\n scale the security of the platform to many applications hosted in other zones\n via the AtomOne Hub ICS; also to demonstrate a decentralized PoS blockchain\n fork experiment based on prior governance voting history as a means for\n-supporting divergent visions on the original chain, the Cosmos Hub Gaia. \n+supporting divergent visions on the original chain, the Cosmos Hub Gaia.\n \n ### Section 4: Cosmonauts, Citizens\n \n@@ -100,15 +100,15 @@ to stake ATONE tokens towards the AtomOne Hub and participate in governance.\n \n The Liberty and Property of all Cosmonauts engaging in the AtomOne Hub is\n hereby guaranteed. Any restriction to the Liberty and Property of Cosmonauts on\n-the AtomOne Hub shall be done only through the AtomOne Hub's governance and\n-requires a Constitutional Majority to pass an amendment to the constitution and\n+the AtomOne Hub shall be done only through the AtomOne Hub’s governance and\n+requires a Constitutional Majority to pass an amendment to the Constitution and\n optionally a set of laws specifying its enforcement.\n \n Every Cosmonaut is entitled to participation rights from their engagement in\n the AtomOne Hub, including rights derived from held or staked ATONE tokens in\n line with the provisions of this Constitution.\n \n-Every staker (including Citizens, but also Validators and non-human entities)\n+Every staker (including Citizens, Validators and other non-human entities)\n allows the Governance of the AtomOne Hub to restrict their staked ATONE tokens\n property by partial or full slashing or freezing, according to their voting\n activity on the hub or on any ICS shard.\n@@ -118,16 +118,16 @@ activity on the hub or on any ICS shard.\n ### Section 1: The AtomOne Hub Chain\n \n The root hub chain of the AtomOne Hub is uniquely identified by the chain-id\n-with the format \"atomone-V”, where V is an integer number that indicates the\n+with the format “atomone-V”, where V is an integer number that indicates the\n version (e.g. atomone-1, atomone-2, etc..). This chain commits and executes\n transactions that serve the following functions:\n \n-- staking of ATONE tokens  \n-- validator selection  \n-- AtomOne Hub Governance  \n-- intra-hub token transfers  \n-- IBC token transfers  \n-- ICS1 and ICS2 management  \n+- staking of ATONE tokens\n+- validator selection\n+- AtomOne Hub Governance\n+- intra-hub token transfers\n+- IBC token transfers\n+- ICS1 and ICS2 management\n - ATONE to PHOTON burn transactions\n \n The root hub chain shall not be used for experimentation. Experimentation shall\n@@ -153,10 +153,11 @@ Governing Documents shall be deemed invalid and abrogated.\n \n Laws may be proposed by any Citizen of the AtomOne Hub through the established\n governance process. The approval of new laws, amendment of existing laws or\n-amendment of this Constitution require a Constitutional Majority vote. However,\n-an endorsement from the Steering DAO shall lower the passing threshold to a\n-Supermajority vote for all proposals except for Constitutional amendment\n-proposals, which shall require a Constitutional Majority.\n+amendment of this Constitution require a Constitutional Majority (see Article\n+2, Section 3) vote. However, an endorsement from the Steering DAO (see Article\n+2, Section 4.b) shall lower the passing threshold to a Supermajority (see\n+Article 2, Section 3) vote for all proposals except for Constitutional\n+amendment proposals, which shall require a Constitutional Majority.\n \n Once an amendment is approved by the required majority, it is implemented\n according to the specified procedures. The implementation process includes\n@@ -164,7 +165,7 @@ updating this Constitution, communicating the changes to the community, and\n ensuring compliance with the new provisions.\n \n Laws must be named plaintext files or folders of plaintext files, or folders of\n-folders. \n+folders.\n \n ### Section 3: AtomOne Hub Governance\n \n@@ -178,17 +179,22 @@ deprecated).\n \n To prevent spam and to ensure the quality of proposals, proposals must have a\n sufficient amount of burn deposit before voting can begin. The minimum amount\n-of burn deposit needed shall self-adjust to target on average 1 proposal per 2\n-week period. \n+of burn deposit needed shall self-adjust based on the number of active\n+proposals on the chain. The target number of simultaneously active proposals\n+is initially set to 2, hence the amount of deposit required to submit a\n+proposal on chain will increase if there are more than 2 active proposals.\n \n-The quorum necessary for a proposal to be valid is 40%. The denominator shall\n-be the number of bonded ATONE tokens. \n+The quorum necessary for a proposal to be valid shall self-adjust between a\n+minimum and a maximum value, based on historical participation. The parameters\n+dictating the ways in which the quorum adjusts - including minimum and maximum\n+value - can be modified through governance. The denominator to compute the\n+quorum shall be the number of bonded ATONE tokens.\n \n A Simple Majority in AtomOne Hub Governance is defined to be exactly “more than\n half”. No proposal is considered to have passed in the AtomOne Hub with a\n Simple Majority; a Supermajority or Constitutional Majority is required. A\n-Supermajority in Hub Governance is defined to be exactly \"more than two\n-thirds\". This is distinct from a Supermajority in DAO council governance which\n+Supermajority in Hub Governance is defined to be exactly “more than two\n+thirds”. This is distinct from a Supermajority in DAO council governance which\n is defined to be exactly “two thirds or more”. For clarity, 3 out of 4 votes is\n necessary for a Supermajority in Hub Governance, but 2 out of 3 is sufficient\n for a Supermajority in DAO council voting. The Constitutional Majority\n@@ -217,7 +223,7 @@ the Descendants of a DAO.\n \n Every DAO, upon creation, must have a Charter (which is composed of Purpose and\n Description), an initial set of Council members (which may be empty) and may\n-also have  Bylaws and Mandates, The Purpose and Description must be plaintext\n+also have Bylaws and Mandates, The Purpose and Description must be plaintext\n files. The Bylaws and Mandates must be named plaintext files or folders of\n plaintext files, or folders of folders.\n \n@@ -227,7 +233,7 @@ require a Supermajority vote.\n \n A DAO’s Bylaws, Mandates, and the Bylaws and Mandates of its ancestor DAOs, the\n relevant Laws, and this Constitution, altogether are called the Governing\n-Documents of the DAO. \n+Documents of the DAO.\n \n A DAO has a Council composed of zero or more members, with no maximum number of\n members unless otherwise specified in its Governing Documents.\n@@ -242,31 +248,31 @@ and bylaws. Sub-DAOs are owned by and can be controlled by the parent DAO, and\n members are also subject to the ancestor DAOs’ bylaws and mandates.\n \n A Simple Majority in DAO governance is defined to be exactly “more than half”.\n-A Supermajority in DAO governance is defined to be exactly \"two thirds or\n-more\". This is distinct from a Supermajority in Hub Governance.\n+A Supermajority in DAO governance is defined to be exactly “two thirds or\n+more”. This is distinct from a Supermajority in Hub Governance.\n \n By default, unless specified otherwise in its Governing Documents, the\n following rules shall apply for Council voting:\n \n - each member shall have equal voting power (no member may occupy multiple\n-  seats)  \n-- a Council member may resign and thereby remove themselves from the Council  \n+  seats)\n+- a Council member may resign and thereby remove themselves from the Council\n - the tally denominator is the number of voters minus ABSTAINs (no quorum\n-  requirement)  \n+  requirement)\n - proposals are open until they are decided by sufficient majority, or\n-  dismissed, or expired  \n+  dismissed, or expired\n - proposals are immediately dismissed by a Simple Majority vote of NO\n \n By default, unless specified otherwise in its Governing Documents, the\n following rules shall apply for Council membership election:\n \n - the Council may elect one or more new members, and/or remove one or more\n-  members, by Super Majority vote. (self mutating).   \n+  members, by Super Majority vote. (self mutating).\n - the DAO’s Ancestors may modify the Council membership with a Super Majority\n   vote.\n \n Each DAO shall have an associated crypto address which can hold any number of\n-tokens.  \n+tokens.\n \n DAOs may operate with logic on core shards, or, represented as a m-of-n\n multisig account on the AtomOne hub where the signers are each members of the\n@@ -278,35 +284,35 @@ governance proposals on the DAO.\n \n As stated, the AtomOne Hub Governance structure will include several DAOs, to\n provide guidance, oversight, and support for various aspects of governance and\n-operations. \n+operations.\n \n The Core DAO Council has the authority to make decisions for the Core DAO\n through a Simple Majority vote of its members, as well as update the Bylaws,\n-but cannot update its Charter or Mandates. \n+but cannot update its Charter or Mandates.\n \n-All Core DAOs and their sub-DAOs shall be composed of Cosmonauts, and the DAO\n-Councils be composed of Citizens. All Cosmonauts and Citizens of these DAOs\n-must have public and known real human identities.\n+All Core DAOs, their sub-DAOs and the DAO Councils shall be composed of\n+Citizens. All Citizens of these DAOs must have public and known real human\n+identities.\n \n Members are encouraged to engage in multiple DAOs within the AtomOne Hub to\n foster collaboration, innovation, and the exchange of ideas. However, to\n maintain the integrity of governance, members must declare their conflicts of\n-interest  and are required to comply with the conflict of interest policies\n+interest and are required to comply with the conflict of interest policies\n outlined in this Constitution, the Laws, and applicable Governing Documents.\n Members must recuse themselves by not voting or voting ABSTAIN on proposals\n that pose a conflict of interest.\n \n The following are Core DAOs of AtomOne:\n \n-- Steering DAO and its subDAOs  \n-- Oversight DAOs and their subDAOs  \n+- Steering DAO and its subDAOs\n+- Oversight DAOs and their subDAOs\n - Special Purpose DAOs and their subDAOs\n \n While Core DAOs are non-person entities and may hold ATONE tokens in its\n treasury, unlike other DAOs, Core DAOs may not stake ATONE tokens.\n \n All Core DAOs must manage the financial resources of its treasury efficiently\n-and transparently at all times. \n+and transparently at all times.\n \n #### Steering DAO\n \n@@ -318,25 +324,24 @@ priorities of the AtomOne Hub.\n \n The Steering DAO can:\n \n-- publish publish periodic announcements on chain  \n+- publish periodic announcements on chain\n - annotate all core DAO proposals with advisory notes to provide context,\n   guidance, and recommendations, offering a non-binding perspective to aid\n-  decision-making.  \n+  decision-making.\n - annotate funding reports to highlight key insights, concerns, and\n-  recommendations.  \n+  recommendations.\n - adjust AtomOne Hub Governance proposal timelines (\"bend time\") to provide\n   additional time for consideration, though this power cannot be used to\n-  indefinitely prevent proposals from being addressed.  \n+  indefinitely prevent proposals from being addressed.\n - reduce the threshold needed to pass new laws from a Constitutional Majority\n   to a Supermajority.\n \n-\n-The mostly advisory nature of the Steering DAO's annotations ensures they guide\n+The mostly advisory nature of the Steering DAO’s annotations ensures they guide\n but do not dictate decisions, and specific limitations on the power to adjust\n proposal timelines must be defined to prevent abuse.\n \n Upon genesis there will be no Steering DAO. A Steering DAO may be created,\n-dismissed, or replaced by a Supermajority vote on AtomOne hub governance. \n+dismissed, or replaced by a Supermajority vote on AtomOne hub governance.\n \n For the purpose of cohesion, before the Steering DAO can be created (or\n replaced), its initial (or new) set of Council members must have all agreed to\n@@ -347,18 +352,18 @@ members, along with the DAO’s identifier.\n \n An Oversight DAO is responsible for ensuring that all laws, bylaws, mandates,\n and core DAO governance proposals as well as AtomOne Hub governance proposals\n-within the scope of its mandate) are in compliance with their respective\n-Governing Documents. \n+(within the scope of its mandate) are in compliance with their respective\n+Governing Documents.\n \n There can be one or more Oversight DAOs.\n \n Any Oversight DAO can (within the scope of its mandate):\n \n - veto any proposal or transaction of any Core DAO or AtomOne Hub with proof of\n-  its violation of Governing Documents.  \n+  its violation of Governing Documents.\n - adjust Core DAO or AtomOne Hub proposal timelines (\"bend time\") to provide\n   additional time for consideration, ensure thorough review, and ensure all\n-  Core DAO and AtomOne Hub proposals comply with its Governing Documents.  \n+  Core DAO and AtomOne Hub proposals comply with its Governing Documents.\n - as exceptions to the above rules, no Oversight DAO may affect any proposals\n   to change any Oversight DAO’s Council membership, or any proposals to suspend\n   or dismiss any Oversight DAO; both of which either require the passage of new\n@@ -369,7 +374,7 @@ override constitutional principles or violate the Constitution, but vetoes\n should be used sparingly and with justification.\n \n Upon genesis there will be no Oversight DAOs. An Oversight DAO may be created,\n-dismissed, or replaced by a Supermajority vote on AtomOne hub governance. \n+dismissed, or replaced by a Supermajority vote on AtomOne hub governance.\n \n ### Section 5: Airdrops and forks\n \n@@ -377,16 +382,17 @@ Every Cosmonaut allows any other Cosmonaut to create full or partial airdrops\n of new tokens to any chain using the distribution of any token on the AtomOne\n Hub at any time.\n \n-Every Citizen allows any Cosmonaut to modify their pro-rata airdrop portion by\n-partial or full slashing (or by proportionate rewards) based on their\n-cryptographic voting activity according to well defined principles at any time.\n+Every ATONE holder allows any Cosmonaut to modify their pro-rata airdrop\n+portion by partial or full slashing (or by proportionate rewards) based on\n+their cryptographic voting activity according to well defined principles at any\n+time.\n \n All forks that lose consensus continuity must change their token ticker symbol\n to be distinct from ATONE. If there are competing blockchains with comparably\n similar continuity, then the fork that has a higher market cap (as measured\n after both tokens have discovered fair market value with sufficient liquidity\n for at least one month) should retain the name while other forks change their\n-    token ticker symbol.\n+token ticker symbol.\n \n ### Section 6: Special Purpose DAOs\n \n@@ -401,20 +407,20 @@ will initially have no council members.\n The BUIDLDAO will support various initiatives that promote the growth,\n development, and sustainability of the AtomOne Hub and its ecosystem.\n \n-**Funding Proposals**  Funding proposals can be submitted to BUIDLDAO by any\n+**Funding Proposals** Funding proposals can be submitted to BUIDLDAO by any\n member of the AtomOne community through a formal proposal process. Proposals\n must outline the objectives, budget, timeline, and expected outcomes of the\n project. The BUIDLDAO reviews and evaluates proposals based on their alignment\n with the AtomOne Hub’s mission and objectives, feasibility, and potential\n impact on the ecosystem.\n \n-**Community Grants**  BUILDDAO provides community grants to support grassroots\n+**Community Grants** BUIDLDAO provides community grants to support grassroots\n initiatives and projects proposed by community members. These grants are aimed\n at fostering innovation, enhancing user experience, and driving community\n engagement. The grant proposal process involves community discussion, feedback,\n and voting to ensure broad support and alignment with the Hub’s goals.\n \n-**Strategic Investments**  BUIDLDAO will not directly make strategic\n+**Strategic Investments** BUIDLDAO will not directly make strategic\n investments. Investments must be made by a special purpose DAO created for the\n purpose of making investments.\n \n@@ -439,11 +445,10 @@ non-compounded per year. The minimum inflation rate shall be 7% non-compounded\n per year. The mechanism by which the inflation rate is adjusted over time shall\n be defined through law.\n \n-Inflated ATONE tokens are paid to bonded ATONE holders in proportion to each\n-delegator's staking amount.\n+Inflated ATONE tokens are paid to bonded ATONE holders.\n \n The ATONE token Unbonding Period shall be a minimum of 3 weeks, and\n-redelegation shall be allowed twice per ATONE Unbonding Period.\n+redelegation shall be allowed up to twice per ATONE Unbonding Period.\n \n Slashing penalties for double-signing and complex-signing failures shall be\n defined through law.\n@@ -470,7 +475,7 @@ the offending transactions excluded from the consumer shard.\n \n ### Section 5: The PHOTON Token\n \n-The PHOTON shall be the only fee token except for ATONE to PHOTON burn\n+The PHOTON token shall be the only fee token except for ATONE to PHOTON burn\n transactions. This applies for all transactions on the root and core shards,\n and all IBC and ICS payments.\n \n@@ -483,7 +488,7 @@ PHOTONs cannot be converted back into ATONE tokens.\n ### Section 6: Third-Party Staking Tokens\n \n AtomOne through law can choose to vote on governance with any staked\n-third-party staking tokens through ICA. \n+third-party staking tokens through ICA.\n \n To exemplify, the law may state that all ATOM tokens staked on Cosmos Hub\n through ICA from AtomOne or any of its consumer shards may have all voting\n@@ -501,7 +506,7 @@ The maximum yearly percentage increase of ATONE tokens supply resulting from\n these special inflation proposals shall be limited to 20%. This hard limit\n cannot be amended even with a Constitutional Majority.\n \n-The special inflation proposal can include a description of the purpose of the\n+The special inflation proposal must include a description of the purpose of the\n inflation, but it cannot include any other modifications to the AtomOne Hub or\n its Constitution, nor the adoption of any new Treasury DAOs.\n \n@@ -518,13 +523,13 @@ The usage of funds available in the Community Pool shall be regulated through\n law and subject to AtomOne Hub Governance, both in terms of destination of\n funds as well as funding processes. A Two-Thirds Supermajority vote from the\n AtomOne Hub Governance shall be required to adopt a designated funding\n-framework as law before any funds from the Community Pool can be used. \n+framework as law before any funds from the Community Pool can be used.\n \n ### Section 9: Validators\n \n-Validators' primary role shall be the securing of the network, and as a\n+Validators’ primary role shall be the securing of the network, and as a\n consequence delegations received through staking from other delegators shall\n-not affect their AtomOne  Hub Governance voting power, which shall be solely\n+not affect their AtomOne Hub Governance voting power, which shall be solely\n equal to their self-delegations.\n \n To ensure greater fairness in the choice of validator delegation the\n@@ -536,7 +541,7 @@ high Nakamoto coefficient, ensuring the sustainable growth of more or less\n equal capacity validators in the long run. In the context of ICS, validators’\n rewards for running consumer chains shall ensure sustainability of the\n infrastructure’s cost, and shall give flexibility for more permissionless\n-validation of consumer shards.  The mechanisms to ensure such design shall be\n+validation of consumer shards. The mechanisms to ensure such design shall be\n defined through law.\n \n ## Article 4: Implementation\n@@ -554,11 +559,11 @@ Adequate time must be provided between the consideration of each proposal to\n allow for comprehensive review and community input. The minimum duration for\n discussion and voting on each proposal shall be two weeks.\n \n-The passing of Software Update Proposals shall require the passage of law. \n+The passing of Software Update Proposals shall require the passage of law.\n \n ATONE stakers are responsible and may be held accountable for voting YES only\n on software update proposals that make correct changes toward the living\n-onstitution and laws (any substantial changes to the software must first be\n+Constitution and laws (any substantial changes to the software must first be\n reflected in the constitution and laws). This responsibility exists\n independently of the Oversight DAOs’ regulatory function.\n \n@@ -573,7 +578,7 @@ The initial version of the AtomOne Hub root chain will use Tendermint v0.3X and\n the Cosmos SDK v0.4X.\n \n The AtomOne Hub shall not have any VM functionality, but shall be plainly\n-implemented in a single garbage-collected language as reference (namely Go);.\n+implemented in a single garbage-collected language as reference (namely Go).\n \n The only cryptographic assumptions allowed to be used by the AtomOne Hub,\n including its consensus protocol shall be Ed25519 and Secp256k1 elliptic\n@@ -608,7 +613,7 @@ restricted so that each can run on a commodity computer.\n - **Additive** - when used in the context of software, it means that it does\n   not require modifying existing primitives.\n - **Airdrop** - a distribution of tokens to some accounts based on predefined\n-  criterias. May be distributed automatically at genesis or post-launch, and\n+  criteria. May be distributed automatically at genesis or post-launch, and\n   may require one or more claim transactions from the accounts, or some other\n   predefined action.\n - **AtomOne Hub** - an opinionated fork of the Cosmos Hub Gaia. It is a minimal\n@@ -620,14 +625,14 @@ restricted so that each can run on a commodity computer.\n   attain governance voting rights. Also known as “staking”.\n - **Bonded Share Unit** - a static representation of a delegator bonded stake\n   in relation to the total stake of the validators to whom he/she has delegated\n-  to. The Bonded Share Unit quantifies the delegator's claim on the rewards and\n-  risks associated with the validator's performance. The total number of Bonded\n+  to. The Bonded Share Unit quantifies the delegator’s claim on the rewards and\n+  risks associated with the validator’s performance. The total number of Bonded\n   Share Units held by a delegator is fixed unless changes occur due to\n   redelegation, but the underlying stake can decrease due to slashing. It is\n   the internal, non-fungible unit of account used for the implementation of\n-  staking.   \n-- **Citizen** - Cosmonaut that has staked his ATONE tokens toward the AtomeOne\n-  Hub, participating in the security of the network and in governance.  \n+  staking.\n+- **Citizen** - Cosmonaut that has staked his ATONE tokens toward the AtomOne\n+  Hub, participating in the security of the network and in governance.\n - **Community Pool** - a community pool is an allocation set aside by the\n   protocol that is continuously growing through the means of a fixed percentage\n   of fees on transactions executed throughout the network and inflationary\n@@ -641,15 +646,17 @@ restricted so that each can run on a commodity computer.\n   holder of any Cosmos Ecosystem token.\n - **Cosmos** - the interchain network composed of many sovereign zones\n   connected by IBC.\n-- **DAO** - Decentralized Autonomous Organization\n+- **DAO** - Decentralized Autonomous Organization, is an organization that is\n+  run on chain and operated collectively by its members, rather than a central\n+  authority.\n - **Economic incentive shares** - units of ownership or participation in an\n   organization designed to align the financial interests of individuals (such\n   as employees, managers, or stakeholders) with the long-term goals and\n   performance of the organization. These shares provide economic benefits, such\n   as dividends or profit-sharing, to incentivize behavior that promotes the\n-  organization's success, productivity, and profitability. They serve as a tool\n+  organization’s success, productivity, and profitability. They serve as a tool\n   for motivating and retaining key individuals by linking their financial\n-  rewards to the organization's performance.\n+  rewards to the organization’s performance.\n - **Fork** - in the context of blockchain, a fork is a copy of an existing\n   blockchain’s distribution and software, with potential modifications and\n   usually a different chain identifier than the original.\n@@ -660,8 +667,8 @@ restricted so that each can run on a commodity computer.\n   Fault Tolerant (BFT) light-client proofs. It allows for the transfer of\n   assets and information across independent blockchains, fostering\n   interoperability and flexibility in the blockchain ecosystem. IBC is a\n-  cornerstone of the Cosmos network's architecture, enabling its vision of an\n-  'Internet of Blockchains'.\n+  cornerstone of the Cosmos network’s architecture, enabling its vision of an\n+  ‘Internet of Blockchains’.\n - **ICS1** - ICS1 short for Inter-Blockchain Security version one, also known\n   as Simple Replicated Security, includes all protocols where the validator set\n   is simply replicated across multiple blockchains, and slash conditions are\n@@ -671,14 +678,14 @@ restricted so that each can run on a commodity computer.\n   validator set are handled by another validator set, where slashing affects\n   tokens on the latter validator set.\n   - **ICS2 type A** - includes all protocols of ICS2 where stake is entirely\n-  managed by the AtomOne Hub (in the form of ATONE tokens or other\n-  derivatives).\n+    managed by the AtomOne Hub (in the form of ATONE tokens or other\n+    derivatives).\n   - **ICS2 type B** - includes all protocols of ICS2 where stake is entirely\n-  managed by the logic of the other chain.\n+    managed by the logic of the other chain.\n - **ICS-secured chain** - a chain that borrows security from the validator set\n   of the AtomOne Hub by replicating it either fully or partially.\n - **Interchain** - Internet of Blockchains\n-- **Interchain Accounts (if we include it)** - a Cosmos-SDK module that allows\n+- **Interchain Accounts** - a Cosmos-SDK module that allows\n   an IBC-connected chain to hold an account on another chain and perform\n   transactions on this other chain.\n - **Liberty** - “the condition of being free from oppressive restriction or\n@@ -705,14 +712,14 @@ restricted so that each can run on a commodity computer.\n       total votes is in favor (YES votes). This threshold definition cannot be\n       changed even with a Constitutional Majority.\n     - **Supermajority of Two-Thirds** - the Supermajority is defined to be\n-      exactly \"more than two thirds\" (+2/3, or at least one iota more than two\n+      exactly “more than two thirds” (+2/3, or at least one iota more than two\n       thirds) and cannot change even by a Constitutional Majority.\n   - **DAO Governance Majority**:\n     - **Simple majority** - a simple majority is achieved when more than 50% of\n       total votes is in favor (YES votes). This threshold definition cannot be\n       changed even with a Constitutional Majority.\n     - **Supermajority of Two-Thirds** - the Supermajority is defined to be\n-      exactly \"two thirds or more\" (\u003e=2/3) and cannot change even by a\n+      exactly “two thirds or more” (\u003e=2/3) and cannot change even by a\n       Constitutional Majority.\n - **Mandates:** - Binding directives issued by the AtomOne Hub or parent DAOs\n   that cannot be amended or repealed by sub-DAOs.\n@@ -734,7 +741,7 @@ restricted so that each can run on a commodity computer.\n   computers. This may have implications for blockchain technology that are\n   worth exploring.\n - **Quorum** - Percentage that represents the vote participation threshold on a\n-  proposal over the total existing voting power. . Whatever the final vote\n+  proposal over the total existing voting power. Whatever the final vote\n   results are, a proposal is automatically rejected if the quorum is not\n   reached.\n - **Root Hub Chain** - see **Root Shard**.\n@@ -775,12 +782,14 @@ restricted so that each can run on a commodity computer.\n   particularly in Proof-of-Stake (PoS) consensus mechanisms. They play a vital\n   role in verifying transactions and adding them to the blockchain. Validators\n   are responsible for confirming the authenticity and accuracy of transaction\n-  records, ensuring the integrity and security of the network.\n+  records, ensuring the integrity and security of the network. Validators can\n+  be either non-human entities or be themselves Citizens if they are a\n+  human individual.\n - **VM** - a virtual machine (VM) in the context of programming is an abstract\n   computing machine that enables a computer program to be executed in a\n   consistent, platform-independent manner. This VM provides a layer of\n   abstraction between the executing program and the underlying hardware,\n-  typically interpreting or compiling the program's code at runtime, thus\n+  typically interpreting or compiling the program’s code at runtime, thus\n   ensuring portability and compatibility across different hardware and\n   operating systems.\n - **Voting shares** - units of ownership in an organization that confer the\n@@ -792,7 +801,7 @@ restricted so that each can run on a commodity computer.\n - **ZK** - a zero-knowledge proof or zero-knowledge protocol is a method by\n   which one party (the prover) can prove to another party (the verifier) that a\n   given statement is true, while avoiding conveying to the verifier any\n-  information beyond the mere fact of the statement's truth. The intuition\n+  information beyond the mere fact of the statement’s truth. The intuition\n   underlying zero-knowledge proofs is that it is trivial to prove the\n   possession of certain information by simply revealing it; the challenge is to\n   prove this possession without revealing the information, or any aspect of it\n",
      "authority": "atone10d07y265gmmuvt4z0w9aw880jnsr700j5z0zqt"
    }
  ],
  "metadata": "https://common.xyz/atomone/discussion/1305011-signaling-proposal-constitution-amendment",
  "title": "Constitution Amendment",
  "summary": "# AtomOne Constitution Amendment\n\nThe AtomOne Constitution is a living document, and as such need to be meticulously maintained and updated whenever required, while focusing on respecting its founding principles and guidelines.\nWith this proposal we introduce several changes to the AtomOne Constitution, and therefore request the AtomOne governance vote to amend it.\n\n# What is being changed\n\nSeveral changes to the text are just intended to fix typos, make punctuation uniform, remove leftover characters - such as spaces - or add references to other parts of the text whenever appropriate. Without listing the full set of changes, we hereby list the most relevant, i.e. all the changes except the aforementioned kinds.\nThe complete diff can be found here: [https://github.com/atomone-hub/genesis/pull/198/files](https://github.com/atomone-hub/genesis/pull/198/files)\n\n## Article 2, Section 3\n\nThe original text:\n\n\u003e To prevent spam and to ensure the quality of proposals, proposals must have a sufficient amount of burn deposit before voting can begin. The minimum amount of burn deposit needed shall self-adjust to target on average 1 proposal per 2week period.\n\nIs changed to:\n\n\u003e To prevent spam and to ensure the quality of proposals, proposals must have a sufficient amount of burn deposit before voting can begin. The minimum amount of burn deposit needed shall self-adjust based on the number of active proposals on the chain. The target number of simultaneously active proposals is initially set to 2, hence the amount of deposit required to submit a proposal on chain will increase if there are more than 2 active proposals.\n\nThe change is intended to align the Constitution with the proposed implementation of the Dynamic Deposit voted in [Proposal 9](https://gov.atom.one/proposals/9).\n\n## Article 2, Section 3\n\nThe original text:\n\n\u003e The quorum necessary for a proposal to be valid is 40%. The denominator shall be the number of bonded ATONE tokens.\n\nIs changed to:\n\n\u003e The quorum necessary for a proposal to be valid shall self-adjust between a minimum and a maximum value, based on historical participation. The parameters dictating the ways in which the quorum adjusts - including minimum and maximum value - can be modified through governance. The denominator to compute the quorum shall be the number of bonded ATONE tokens.\n\nThis change is intended to fix an inconsistency between Constitution and implementation, and align the text with the Dynamic Quorum voted in [Proposal 11](https://gov.atom.one/proposals/11).\n\n## Article 2, Section 4.b\n\nThe original text:\n\n\u003e All Core DAOs and their sub-DAOs shall be composed of Cosmonauts, and the DAO Councils be composed of Citizens. All Cosmonauts and Citizens of these DAOs must have public and known real human identities.\n\nIs changed to:\n\n\u003e All Core DAOs, their sub-DAOs and the DAO Councils shall be composed of Citizens. All Citizens of these DAOs must have public and known real human identities.\n\nThis change is intended to restrict DAO participation to Citizens instead of the more broad Cosmonauts.\n\n## Article 2, Section 5\n\nThe original text:\n\n\u003e Every Citizen allows any Cosmonaut to modify their pro-rata airdrop portion by partial or full slashing (or by proportionate rewards) based on their cryptographic voting activity according to well defined principles at any time.\n\nIs changed to:\n\n\u003e Every ATONE holder allows any Cosmonaut to modify their pro-rata airdrop portion by partial or full slashing (or by proportionate rewards) based on their cryptographic voting activity according to well defined principles at any time.\n\nThis change is intended to broaden the provision to encompass any ATONE holder, and not just Citizens.\n\n## Article 3, Section 2\n\nThe original text\n\n\u003e Inflated ATONE tokens are paid to bonded ATONE holders in proportion to each delegator's staking amount.\n\nIs changed to:\n\n\u003e Inflated ATONE tokens are paid to bonded ATONE holders.\n\nThis slight modification is intended to accomodate the Nakamoto Bonus voted in [Proposal 12](https://gov.atom.one/proposals/12).\n\n## Article 3, Section 2\n\nThe original text\n\n\u003e redelegation shall be allowed twice per ATONE Unbonding Period\n\nIs changed to:\n\n\u003e redelegation shall be allowed up to twice per ATONE Unbonding Period\n\nThis modification is intended to align the Constitution with the current implementation while still retaining the restriction, but only set as an upper bound.\n\n# Constitution Amendment voting procedure\n\nIt is here noted that for a Constitution Amendment to pass the vote need to reach a Constitutional Majority, which is set at 90%. Therefore the Amendment will only go into effect if the threshold of 90% YES votes is reached.\n\n# Governance votes\n\nThe following items summarize the voting options and what it means for this proposal:\n\nYES - You agree that the AtomOne Constitution should be amended with the proposed changes.\nNO - You disagree that the AtomOne Constitution should be amended with the proposed changes.\nABSTAIN - You wish to contribute to the quorum but you formally decline to vote either for or against the proposal.\n"
}
